{
    "NAVIGATION": {
        "HELP": "Hilfe"
    },
    "TUTORIAL": {
        "TITLE": "Mit Beispieldaten loslegen",
        "PARAGRAPH_1": "Die Arbeit mit Beispieldaten hilft dir, CrateDB etwas besser zu verstehen. Mit diesem Twitter-Importer ist das ganz einfach und du kannst schnell und mühelos deine neue CrateDB Instanz mit realen Daten testen. Klicke auf den Button, und beobachte wie dein Cluster in Echtzeit mit Live-Tweets gefüllt wird. Keine Sorge, diese können später immer noch gelöscht werden.",
        "PARAGRAPH_2": "Nach der Authentifizierung werden Tweets einzeln importiert, was natürlich langsam ist. Allerdings können in einer Produktionsumgebung bis zu mehreren tausend Datensätze pro Sekunde indiziert werden.",
        "INSTRUCTION_1": "Deine Tweets werden in der Tabelle {tweets} gespeichert",
        "TWEETS": "tweets",
        "INSTRUCTION_2": "Klicke in der linken Menüleiste auf {tables} um alle Tabellen und deren Statistiken zu sehen. Du siehst, wie die Anzahl der Datensätze steigt während neue Daten von Twitter importiert werden.",
        "TABLES": "TABLES",
        "INSTRUCTION_3": "Klicke in der linken Menüleiste auf {console} um eine SQL-Abfrage zu starten. Zum Beispiel: {query}",
        "CONSOLE": "KONSOLE",
        "IMPORT_TWEETS": "Importiere Tweets",
        "IMPORTING_TWEETS": "Importiere Tweets.",
        "TWEETS_IMPORTED": "Tweets importiert.",
        "STOP_IMPORTING_TWEETS": "Genug! Import gestoppt."
    },
    "CALCULATOR": {
        "TITLE": "Shard Rechner",
        "DESCRIPTION": "Ein einfaches Werkzeug um eine generische Empfehlung für die Shard Größe für eine Tabelle in der CrateDB.",
        "IMPORT_HEADING": "Daten von einer bereits existierenden Tabelle einlesen",
        "HARDWARE_HEADING": "Hardware",
        "CPUS_HEADING": "CPUs",
        "CPUS_DESCRIPTION": "Wie viele CPU Kerne haben die Rechner auf welchen die Knoten laufen?",
        "STORAGE_HEADING": "Präsistenter Speicher",
        "STORAGE_DESCRIPTION": "Du verwendest SSDs anstadt HDDS? Gut.",
        "RAMSTORAGE_HEADING": "Haupspeicher im Verhaltnis zu präsistentem Speicher",
        "RAMSTORAGE_DESCRIPTION": "Das Verhältnis von Haupspeicher und prästistentem Speicher beinflusst die Leistung ganz allgemein. Ein Verältnis um 1:24 wird empfohlen. Wenn die Geschwindigkeit nicht so wichtig ist, kann auch darunter gegangen werden. Für eine schnelleres Cluster, kann ein engeres Verhältnis gewählt werden, aber astronomische Werte bringen natürlich nichts.",
        "RAMSTORAGE_INPUT_1": "Jedes GB RAM dient",
        "RAMSTORAGE_INPUT_2": "GB von präsistentem Speicher.",
        "RAM_HEADING": "RAM",
        "RAM_DESCRIPTION_1": "Wie viel Hauptspeicher haben die Rechner auf welchen die Knoten laufen sollen? Es wird empfohlen die Hälfte des Haupspeichers der virtuellen Java Maschiene zur Verfügung zu stellen und den Rest dem Betriebsystem. 64GB an Haupspeicher sind ein guter Richtwert.",
        "RAM_DESCRIPTION_2": "Byte",
        "RAM_DESCRIPTION_3": "Wenn mehr als 32GB der JVM als Heap zugewiesen werden, ist es gut möglich, dass es Probleme bei der Garbage Collection gibt.",
        "RAID_HEADING": "RAID?",
        "RAID_DESCRIPTION": "CrateDB ist verteilt und selbst-heilend, Replikate der Daten werden im Cluster verteilt, wenn sie eingeschaltet sind. Das ist empfehlenswert, denn es macht RAID1 überflüssig und ermöglicht sogar den sicheren Einsatz von RAID0.",
        "USECASE_HEADING": "Anwendungsfall",
        "DATA_HEADING": "Daten",
        "DATA_DESCRIPTION_1": "Hierum dreht es sich bei crate. Du hast vermutlich schon eine andere Datenbankt in Verwendung gehabt und weißt vermutlich um viel Daten es geht.",
        "DATA_DESCRIPTION_2": "Wie viel wird eingefügt?",
        "DATA_DESCRIPTION_3": "Byte pro",
        "DATA_DESCRIPTION_4": "Und wie lange sollen sie gespeichert werden?",
        "DATA_DESCRIPTION_5": "Weil crate horizontal skallierbar ist, können auch immer später noch weitere Knoten hinzugefügt werden, um die Daten länger auf zu bewahren.",
        "DATA_DESCRIPTION_6": "ODER, wenn nicht bekannt ist, wann wie viel Daten eingefügt werden, kannst du auch einfach eine erwartete Tabellen Größe angeben.",
        "DATA_DESCRIPTION_7": "Byte",
        "PARTITION_HEADING": "Partitionierung",
        "PARTITION_DESCRIPTION_1": "crate organisirt die Daten in logische Einheiten, typischerweise nach Zeit. Wenn ein guter Zeitraum gewählt ist, kann das die Leistung drastisch erhöhen.",
        "PARTITION_DESCRIPTION_2": "Wähle eine Größeneinheit, in der die Daten später verwendet werden. Wenn du keine Ahnung hast, dann ist ein Monat eine gute Empfehlung.",
        "PARTITION_DESCRIPTION_3": "Du hast 'erwartete Tabellen Größe' ausgewählt, in dem Fall musst du die Anzahl der Partitionen manuell festlegen.",
        "REDUNDANCY_HEADING": "Redundanz",
        "REDUNDANCY_DESCRIPTION": "Wie gesagt verteilt crate Replikate über das ganze Cluster, ein Replikat sollte speicherplatzmäßig leistbar sein. Um Redundanz und um Datenintegrität zu gewährleisten. Keine Replikate zu haben ist naturlich am sparsamsten was den Speicher angeht, ist aber nicht empfehlenswert. Mehrere Replikate können die Abfragegeschwindigkeit signiffikant erhöhen, denn die Abfrage kann simultan auf mehreren Kopien des selben Datensatzes laufen. Der Nachteil ist natürlich der Speicherbedarf und es beinträchtigt sogar die Schreibgeschwindigkeit ein Bisschen. Demnach einst ein Replikat der normale Weg, wenn aber die Lesegeschwindigkeit wichtig ist kann man auch 3 oder 4 nehmen. Abgesehen davon, mehr Replikate als Knoten machen keinen Sinn. Sie können nirgendwo hin.",
        "CALCULATION_HEADING": "Berechnung",
        "CALCULATION_DESCRIPTION": "Mit den bereitgestellten Informationen, kommt dieses kleine Skript auf folgende Empfehlung:",
        "NODES_HEADING": "Knoten",
        "NODES_DESCRIPTION_1": "Du solltest",
        "NODES_DESCRIPTION_2": "Knoten mit jeweils",
        "NODES_DESCRIPTION_3": "Haupspeicher und",
        "NODES_DESCRIPTION_4": "an präsistentem Speicher einsetzen.",
        "SHARDS_HEADING": "Shards",
        "SHARDS_DESCRIPTION_1": "Die Partitionen sollten jeweils in",
        "SHARDS_DESCRIPTION_2": "Shards unterteilt werden.",
        "HOUR": "Stunde",
        "DAY": "Tag",
        "WEEK": "Woche",
        "MONTH": "Monat",
        "YEAR": "Jahr"
    }
}
